package de.telran.averchenko.elena.homework9;

import java.util.NavigableSet;

public class Theory {
    // 1. Изначально Set:
    //    - не имеет дубликатов,
    //    - порядок вставки не важен,
    //    - нет доступа по индексу.
    //    SortedSet - дополнительно множество будет отсортированным.
    //    NavigableSet - расширяет интерфейс SortedSet, и по множеству можно идти в обе стороны.

    // 2. null можно положить в HashSet.

    // 3. TreeSet лучше использовать со множествами, где важен порядок.
    //    HashSet - там, где важнее уникальность (уникальность e-mail, названий документов и т.д.)

    // 4. HashSet. Тут все данный неупорядочены и неотсортировани.
    //    LinkedHashSet - в нем гарантируется порядок элементов, и они отсортированы.


}
