package de.telran.averchenko.elena.homework6;

public class Theory {
    // 1. Коллекции. необходимы для хранения данных. Каждый из интерфейсов коллекции позволяет иначе работать с
    //    данными.
    //    Set - не упорядоченное множество (как, например, куча - The Heap)
    //    List - упорядоченная коллекция (связанный список, массив)
    //    Queue - упорядоченная коллекция, работающая по принципу: FIFO - First In - First Out (первый зашел - первый вышел).
    //
    // 2. LinkedList - это связанный список (двунаправленная очередь). Т.е каждый элемент знает о предыдущем и
    //    о следующем. По сути - это один из методов реализации интерфейса List. Методы схожи с методами динамического
    //    массива. А также имеется переопрееленный метод toString().
    //
    // 3. Set гарантирует, что не будет дубликатов (т.е., повторяющихся значений). Set не дает возможности
    //    обращаться к данным по индексу, нет порядка у элементов.
    //
    // 4. List не гарантирует, что хранящиеся значения уникальны, могут быть повторы. Но List гарантирует простой доступ
    //    к элементам по ииндексу (тут имеет значение порядок).

}
